# Different ways of creating Series and Dataframes

In [4]:
import pandas as pd
import numpy as np

### Creating Series

In [3]:
# Using List
pd.Series(['red','blue','green','black'])

0      red
1     blue
2    green
3    black
dtype: object

In [41]:
#using Np array
S1 = pd.Series(np.array([1,2,4,5]),index=['a','b','c','d'])
S1

a    1
b    2
c    4
d    5
dtype: int32

In [7]:
#using Dictionary
pd.Series({'a':1,'b':2,'c':3})

a    1
b    2
c    3
dtype: int64

In [27]:
#using scaler number
pd.Series(4,index=[0,1,2,3,4])

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [16]:
#giving a name to series and changing dtype
pd.Series(4,index=[1,2,3],dtype='str',name='number')

1    4
2    4
3    4
Name: number, dtype: object

### Acessing the elements and methods of object

In [42]:
S1[2]

4

In [43]:
S1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [44]:
S1.values

array([1, 2, 4, 5])

In [45]:
S1.dtype,     S1.shape

(dtype('int32'), (4,))

In [46]:
S1.empty  , S1.hasnans    , S1.count

(False,
 False,
 <bound method Series.count of a    1
 b    2
 c    4
 d    5
 dtype: int32>)

In [47]:
S1.value_counts(normalize=False, sort=True, ascending=False)
#if normalize is true , reletive frequencies are shown

1    1
2    1
4    1
5    1
dtype: int64

In [48]:
S1.value_counts(normalize=True, sort=True, ascending=False)

1    0.25
2    0.25
4    0.25
5    0.25
dtype: float64

In [49]:
#converting it to DataFrame
S1.to_frame()

   0
a  1
b  2
c  4
d  5

In [50]:
pd.unique(S1)

array([1, 2, 4, 5])

# Creating a DataFrame

In [54]:
#using numpy array
pd.DataFrame(np.arange(3,8))

   0
0  3
1  4
2  5
3  6
4  7

In [56]:
#using list
li=['a','b','c','d'] 
    
pd.DataFrame(li)

   0
0  a
1  b
2  c
3  d

In [57]:
#using list and using parameters
li=['a','b','c','d'] 

pd.DataFrame(li , index =li ,columns =['alphabet'])

  alphabet
a        a
b        b
c        c
d        d

In [58]:
# using dictionary
d ={'col1': [1, 2], 'col2': [3, 4]}
pd.DataFrame(d)

   col1  col2
0     1     3
1     2     4

In [66]:
S1

a    1
b    2
c    4
d    5
dtype: int32

In [67]:
d = {'col1': S1, 'col2': [0,2,3, 4]}

pd.DataFrame(d, index = S1.index)

   col1  col2
a     1     0
b     2     2
c     4     3
d     5     4

In [68]:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                    columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### Acessing and using Attibutes

In [71]:
df2['d'] =pd.Series([10,11,12])
df2

   a  b  c   d
0  1  2  3  10
1  4  5  6  11
2  7  8  9  12

In [73]:
del df2['d']
df2

In [78]:
df2.pop('c')
df2

In [79]:
df2.index= ['a','b','c']

In [80]:
df2

   a  b
a  1  2
b  4  5
c  7  8

In [82]:
df2.loc['b']

a    4
b    5
Name: b, dtype: int32

In [84]:
df2.iloc[2]

a    7
b    8
Name: c, dtype: int32

In [85]:
df2[1:2]

   a  b
b  4  5

In [ ]:
df2.append(d2)

In [86]:
df2.drop(['a'],axis=1)

   b
a  2
b  5
c  8

DataFrame.append()DataFrame.apply()DataFrame.aggregate()DataFrame.assign()DataFrame.astype()DataFrame.count()DataFrame.cut()
DataFrame.describe()DataFrame.drop_duplicates()DataFrame.groupby()DataFrame.head()DataFrame.hist()DataFrame.iterrows()
DataFrame.join()DataFrame.mean()DataFrame.melt()DataFrame.merge()DataFrame.pivot_table()DataFrame.query()DataFrame.rename()
DataFrame.sample()DataFrame.shift()DataFrame.sort()DataFrame.sum()DataFrame.to_excel()DataFrame.transform()
DataFrame.transpose()DataFrame.where()

In [87]:
info = pd.DataFrame([[2, 7]] * 4, columns=['P', 'Q'])  
info.apply(np.sqrt)  
info.apply(np.sum, axis=0)  
info.apply(np.sum, axis=1)  
info.apply(lambda x: [1, 2], axis=1)  
info.apply(lambda x: [1, 2], axis=1, result_type='expand')  
info.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)  
info.apply(lambda x: [1, 2], axis=1, result_type='broadcast')  
info

   P  Q
0  2  7
1  2  7
2  2  7
3  2  7

In [ ]:
info.append(info2, ignore_index = True)

In [ ]:
info.assign(temp_f=lambda x: x.temp_c * 7 / 2 + 24)  
# new coloumn

In [88]:
info.agg(['sum','min'])

     P   Q
sum  8  28
min  2   7

In [ ]:
x2 = x1.astype('int64', copy=False)

In [ ]:
info.count()

In [ ]:
grouped = df.groupby('Course')  
print(grouped['Percentage'].agg(np.mean))

In [ ]:
grouped = df.groupby('Course')  
print (df.groupby('Course').filter(lambda x: len(x) >= 1))

In [ ]:
iterrows(), iteritems() and itertuples()

In [ ]:
pd.melt(info, id_vars =['Name'], value_vars =['Language'])
# returns the unpivoted DataFrame as the output.

In [ ]:
 pd.pivot_table(info, index =['P', 'Q'])

In [ ]:
info.sample(frac=0.5, replace=True, random_state=1) 
# pick random sample

In [ ]:
aa.insert(2, column = "Department", value = "B.Sc")  
#new column

In [ ]:
DataFrame.to_numpy(dtype=None, copy=False)

In [ ]:
info.isin(range(1,8))